{"format":"layers-model","generatedBy":"keras v3.13.0","convertedBy":"TensorFlow.js Converter v4.22.0","modelTopology":{"keras_version":"3.13.0","backend":"tensorflow","model_config":{"class_name":"Functional","config":{"name":"alpha_engine","trainable":true,"layers":[{"class_name":"InputLayer","config":{"dtype":"float32","sparse":false,"ragged":false,"name":"features","optional":false,"batchInputShape":[null,55]},"name":"features","inbound_nodes":[]},{"class_name":"Dense","config":{"name":"hidden_0","trainable":true,"dtype":"float32","units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"quantization_config":null},"name":"hidden_0","inbound_nodes":[[["features",0,0,{}]]]},{"class_name":"BatchNormalization","config":{"name":"bn_0","trainable":true,"dtype":"float32","axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"moving_mean_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"moving_variance_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"synchronized":false},"name":"bn_0","inbound_nodes":[[["hidden_0",0,0,{"mask":null}]]]},{"class_name":"Dropout","config":{"name":"dropout_0","trainable":true,"dtype":"float32","rate":0.2,"seed":null,"noise_shape":null},"name":"dropout_0","inbound_nodes":[[["bn_0",0,0,{"training":false}]]]},{"class_name":"Dense","config":{"name":"hidden_1","trainable":true,"dtype":"float32","units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"quantization_config":null},"name":"hidden_1","inbound_nodes":[[["dropout_0",0,0,{}]]]},{"class_name":"BatchNormalization","config":{"name":"bn_1","trainable":true,"dtype":"float32","axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"moving_mean_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"moving_variance_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"synchronized":false},"name":"bn_1","inbound_nodes":[[["hidden_1",0,0,{"mask":null}]]]},{"class_name":"Dropout","config":{"name":"dropout_1","trainable":true,"dtype":"float32","rate":0.2,"seed":null,"noise_shape":null},"name":"dropout_1","inbound_nodes":[[["bn_1",0,0,{"training":false}]]]},{"class_name":"Dense","config":{"name":"hidden_2","trainable":true,"dtype":"float32","units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"quantization_config":null},"name":"hidden_2","inbound_nodes":[[["dropout_1",0,0,{}]]]},{"class_name":"BatchNormalization","config":{"name":"bn_2","trainable":true,"dtype":"float32","axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"moving_mean_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"moving_variance_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"synchronized":false},"name":"bn_2","inbound_nodes":[[["hidden_2",0,0,{"mask":null}]]]},{"class_name":"Dropout","config":{"name":"dropout_2","trainable":true,"dtype":"float32","rate":0.2,"seed":null,"noise_shape":null},"name":"dropout_2","inbound_nodes":[[["bn_2",0,0,{"training":false}]]]},{"class_name":"Dense","config":{"name":"prediction","trainable":true,"dtype":"float32","units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"quantization_config":null},"name":"prediction","inbound_nodes":[[["dropout_2",0,0,{}]]]}],"input_layers":[["features",0,0]],"output_layers":[["prediction",0,0]]}},"training_config":{"loss":"binary_crossentropy","loss_weights":null,"metrics":["accuracy",{"class_name":"AUC","config":{"name":"auc","dtype":"float32","num_thresholds":200,"curve":"ROC","summation_method":"interpolation","multi_label":false,"num_labels":null,"label_weights":null,"from_logits":false}}],"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":false,"optimizer_config":{"class_name":"Adam","config":{"name":"adam","learning_rate":1.5625000742147677e-05,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"beta_1":0.9,"beta_2":0.999,"epsilon":1e-07,"amsgrad":false}}}},"weightsManifest":[{"paths":["group1-shard1of1.bin"],"weights":[{"name":"bn_0/gamma","shape":[64],"dtype":"float32"},{"name":"bn_0/beta","shape":[64],"dtype":"float32"},{"name":"bn_0/moving_mean","shape":[64],"dtype":"float32"},{"name":"bn_0/moving_variance","shape":[64],"dtype":"float32"},{"name":"bn_1/gamma","shape":[32],"dtype":"float32"},{"name":"bn_1/beta","shape":[32],"dtype":"float32"},{"name":"bn_1/moving_mean","shape":[32],"dtype":"float32"},{"name":"bn_1/moving_variance","shape":[32],"dtype":"float32"},{"name":"bn_2/gamma","shape":[16],"dtype":"float32"},{"name":"bn_2/beta","shape":[16],"dtype":"float32"},{"name":"bn_2/moving_mean","shape":[16],"dtype":"float32"},{"name":"bn_2/moving_variance","shape":[16],"dtype":"float32"},{"name":"hidden_0/kernel","shape":[55,64],"dtype":"float32"},{"name":"hidden_0/bias","shape":[64],"dtype":"float32"},{"name":"hidden_1/kernel","shape":[64,32],"dtype":"float32"},{"name":"hidden_1/bias","shape":[32],"dtype":"float32"},{"name":"hidden_2/kernel","shape":[32,16],"dtype":"float32"},{"name":"hidden_2/bias","shape":[16],"dtype":"float32"},{"name":"prediction/kernel","shape":[16,1],"dtype":"float32"},{"name":"prediction/bias","shape":[1],"dtype":"float32"}]}]}